Revit 2027 API
FamilyParameter.IsShared Property
Identifies if the parameter is a shared parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsShared { get; }
Public ReadOnly Property IsShared As Boolean
	Get
public:
property bool IsShared {
	bool get ();
}
member IsShared : bool with get
Property Value
Boolean
See Also
Reference
FamilyParameter Class
Autodesk.Revit.DB Namespace